schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
uint32_t    g_can_recoveries = 0;   // bus-off recoveries initiated since boot
uint32_t    g_socketcand_tx_dropped = 0;   // frames dropped on full client TCP buffers
bool        g_can_initialized = false;
bool        g_ap_running      = false;

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── SD-card session logging (RejsaCAN) ──────────────────────────────────────────
// Records two streams to the onboard microSD whenever a card is present at boot:
//
//   /sNNNNN/raw_PP.asc    every received CAN frame, Vector ASCII — replayable by
//                         solecan-analyze.py / solecan-stream.py --replay unchanged
//   /sNNNNN/data_PP.jsonl one buildJson() snapshot per line at SD_JSON_HZ (default 1)
//
// Design (see also the plan): loop() (core 1) only *formats* bytes and pushes them
// into two PSRAM ring buffers; a dedicated writer task (core 0) does every SD I/O.
// This keeps the decoded-state globals single-threaded — buildJson() and the .asc
// formatter both run on the loop task, and only opaque bytes cross to the writer —
// and it keeps SD stalls (block erase) off the CAN drain: a full ring drops whole
// lines (counted) rather than blocking loop(). Mid-session SD failures are
// handled by remount-and-resume (see sdRecoverOrFail); only repeated back-to-back
// failures latch "error" until reboot. No hot-insert: the card is probed once at
// boot; if it isn't there, the whole feature stays dormant (reboot to use a card
// inserted later).
#if defined(HAS_SD)

// ── Tunables ──
#ifndef SD_JSON_HZ
#define SD_JSON_HZ          1                         // decoded-snapshot cadence
#endif
#define SD_MAX_PART_BYTES   (64ULL * 1024 * 1024)     // roll raw/json parts at this size
#define SD_MIN_FREE_BYTES   (512ULL * 1024 * 1024)    // reap oldest sessions below this
#define SD_FLUSH_MS         1000                      // fsync cadence → ≤~1 s lost on power cut
#define SD_RAW_RING_BYTES   (1024UL * 1024)           // PSRAM ring for raw .asc
#define SD_JSON_RING_BYTES  (256UL * 1024)            // PSRAM ring for json lines
#define SD_FREE_CHECK_MS    10000                     // usedBytes() is slow — poll sparingly
#define SD_RECOVER_ATTEMPTS 5                         // remount tries before latching error
#define SD_RECOVER_DELAY_MS 250                       // backoff base between remount tries

struct SdState {
    const char* state = "no_card";     // no_card | logging | error
    uint32_t          session   = 0;
    uint16_t          raw_part  = 0;
    uint16_t          json_part = 0;
    volatile uint32_t mb_written = 0;  // writer task (core 0) owns these two
    volatile uint32_t free_mb    = 0;
    volatile uint32_t raw_dropped  = 0;  // producer (core 1) owns these two
    volatile uint32_t json_dropped = 0;
    const char*       fail_op  = "";     // which SD call failed (state == "error")
    volatile uint32_t fail_kb  = 0;      // KB written when it failed
    volatile uint32_t recoveries = 0;    // successful remount-and-resume cycles
};
static SdState g_sd;

// Set true once at boot after a successful mount + first session open; gates the
// producer in loop(). Only ever cleared again (mid-session card failure), never
// re-armed until reboot. This flag is the *only* state shared across the core
// boundary — the writer task otherwise sees nothing but bytes in the ring buffers.
volatile bool g_sd_active = false;

static StreamBufferHandle_t g_sd_raw_sb  = nullptr;
static StreamBufferHandle_t g_sd_json_sb = nullptr;
static StaticStreamBuffer_t g_sd_raw_sb_struct;
static StaticStreamBuffer_t g_sd_json_sb_struct;
static uint8_t*             g_sd_raw_storage  = nullptr;
static uint8_t*             g_sd_json_storage = nullptr;

static File    g_sd_raw_file;
static File    g_sd_json_file;
static int64_t g_sd_session_start_us = 0;   // esp_timer µs at session open (log t=0)

// ── Producer side (runs on the loop task, core 1) ──

// Format one frame as a Vector ASCII data line and push it to the raw ring.
// Line-atomic: if the whole line doesn't fit, drop it and count it rather than
// write a fragment or block the CAN drain.
static inline void sdEnqueueRaw(const twai_message_t& msg) {
    char line[96];
    double ts = (esp_timer_get_time() - g_sd_session_start_us) / 1e6;
    int n = snprintf(line, sizeof line, " %.6f 1  %0*lX%s   Rx   d %u",
                     ts, msg.extd ? 8 : 3, (unsigned long)msg.identifier,
                     msg.extd ? "x" : "", (unsigned)msg.data_length_code);
    for (int i = 0; i < msg.data_length_code && n < (int)sizeof line - 4; i++)
        n += snprintf(line + n, sizeof line - n, " %02X", msg.data[i]);
    if (n < (int)sizeof line - 1) line[n++] = '\n';
    if (xStreamBufferSpacesAvailable(g_sd_raw_sb) >= (size_t)n)
        xStreamBufferSend(g_sd_raw_sb, line, n, 0);
    else
        g_sd.raw_dropped++;
}

